<script lang="ts" setup>
const items = [
    {
        label: "Что такое R:ED - ROBOTICS EDUCATION?",
        slot: "whatisit",
    },
    {
        label: "Какие возможности предоставляет R:ED - ROBOTICS EDUCATION?",
        slot: "oportunities",
    },
    {
        label: "Какие возрастные группы могут воспользоваться ресурсами R:ED - ROBOTICS EDUCATION?",
        slot: "agegroups",
    },
    {
        label: "Есть ли возможность получить сертификат о прохождении курса на R:ED - ROBOTICS EDUCATION?",
        slot: "certificate",
    },
    {
        label: "Используются ли конструкторы R:ED в качестве оборудования для робототехнических соревнований?",
        slot: "competitive",
    },
];
</script>

<template>
    <div class="__faq p-8 min-h-[60vh]">
        <h1 class="text-3xl">Часто задаваемые вопроосы</h1>
        <hr class="my-8" />
        <UAccordion :items="items">
            <template #whatisit>
                <div>
                    R:ED - ROBOTICS EDUCATION является сайтом, который
                    предлагает образовательные ресурсы и материалы для изучения
                    робототехники и программирования.
                    <br />
                    R:ED — первый международный образовательный проект, в
                    сегменте Educational Development, включающий:
                    <ol
                        style="
                             {
                                list-style-type: decimal;
                            }
                        "
                    >
                        <li>конструкторы различных модификаций;</li>
                        <li>учебно-методические комплексы;</li>
                        <li>программное обеспечение;</li>
                    </ol>
                </div>
            </template>
            <template #oportunities>
                <div>
                    R:ED - ROBOTICS EDUCATION предоставляет учебные материалы,
                    практические проекты и информацию о последних новинках и
                    технологиях в области робототехники
                </div></template
            >
            <template #agegroups>
                <div>
                    Ресурсы R:ED - ROBOTICS EDUCATION предназначены для широкой
                    аудитории: от детей и подростков, интересующихся
                    робототехникой, до взрослых, желающих расширить свои знания
                    в этой области.
                </div>
            </template>
            <template #certificate>
                <div>
                    Да, курсы R:ED - ROBOTICS EDUCATION предоставляют
                    возможность получить сертификат о прохождении, который
                    подтверждает успешное окончание курса
                </div>
            </template>
            <template #competitive>
                <div>
                    Конструкторы R:ED являются официальным оборудованием многих
                    соревнований по робототехнике и программированию:
                    <ol
                        style="
                             {
                                list-style-type: decimal;
                            }
                        "
                    >
                        <li>
                            Национальной Технологической Олимпиады (НТО) Junior,
                            сфера «Технологии и роботы на производстве»
                        </li>
                        <li>
                            Чемпионата по робототехнике и программированию
                            (Проводится Казанским Федеральным Университетом)
                        </li>
                        <li>
                            Международных соревнований по цифровым технологиям,
                            образовательной робототехнике и нейротехнологиям
                            «ДЕТалька»
                        </li>
                        <li>
                            Международного фестиваля по робототехнике и
                            программированию R:ED Fest (входит в перечень
                            мероприятий Министерства Просвещения РФ)
                        </li>
                        <li>«РобоФиниста»</li>
                        <li>
                            Всероссийских междисциплинарных технологических
                            соревнований «Техно-вызов: инженеры будущего»;
                        </li>
                        <li>WorldSkills, компетенция «Преподавание Технологии»</li>
                    </ol>
                </div>
            </template>
        </UAccordion>
    </div>
</template>

<style lang="scss" scoped></style>
